[Killed] BlockStatement
src/operacoes.js:48:27
 function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
 function aumentarPorcentagem(valor, percentual) { return valor * (1 + percentual / 100); }
 function diminuirPorcentagem(valor, percentual) { return valor * (1 - percentual / 100); }
-function inverterSinal(n) {
-    if (n === 0) {
-        return 0;
-    }
-    return -n;
-}
+function inverterSinal(n) {}
 
 // === Bloco 3: Funções Trigonométricas e Logarítmicas (21-30) ===
killedBy: Suíte de Testes Reforçada para 50 Operações Aritméticas 20. deve inverter o sinal de um número positivo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -42
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:49:9
 function aumentarPorcentagem(valor, percentual) { return valor * (1 + percentual / 100); }
 function diminuirPorcentagem(valor, percentual) { return valor * (1 - percentual / 100); }
 function inverterSinal(n) {
-    if (n === 0) {
+    if (false) {
         return 0;
     }
killedBy: Suíte de Testes Reforçada para 50 Operações Aritméticas 20.1 inverter sinal de zero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -0

[Killed] ConditionalExpression
src/operacoes.js:49:9
 function aumentarPorcentagem(valor, percentual) { return valor * (1 + percentual / 100); }
 function diminuirPorcentagem(valor, percentual) { return valor * (1 - percentual / 100); }
 function inverterSinal(n) {
-    if (n === 0) {
+    if (true) {
         return 0;
     }
killedBy: Suíte de Testes Reforçada para 50 Operações Aritméticas 20. deve inverter o sinal de um número positivo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -42
Received: 0

[Killed] UnaryOperator
src/operacoes.js:52:12
     if (n === 0) {
         return 0;
     }
-    return -n;
+    return +n;
 }
 
killedBy: Suíte de Testes Reforçada para 50 Operações Aritméticas 20. deve inverter o sinal de um número positivo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -42
Received: 42

[Killed] BlockStatement
src/operacoes.js:88:32
   if (n <= 1) return n;
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
-function produtoArray(numeros) {
-    if (numeros.length === 0) {
-        // Lançar um erro para array vazio.
-        throw new Error('Array vazio não possui produto definido.'); 
-    }
-    return numeros.reduce((acc, val) => acc * val, 1);
-}
+function produtoArray(numeros) {}
 function clamp(valor, min, max) {
   if (min > max) [min, max] = [max, min]; 
killedBy: Suíte de Testes Reforçada para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:89:9
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
 function produtoArray(numeros) {
-    if (numeros.length === 0) {
+    if (numeros.length !== 0) {
         // Lançar um erro para array vazio.
         throw new Error('Array vazio não possui produto definido.'); 
killedBy: Suíte de Testes Reforçada para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: Array vazio não possui produto definido.

[Killed] ConditionalExpression
src/operacoes.js:89:9
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
 function produtoArray(numeros) {
-    if (numeros.length === 0) {
+    if (false) {
         // Lançar um erro para array vazio.
         throw new Error('Array vazio não possui produto definido.'); 
killedBy: Suíte de Testes Reforçada para 50 Operações Aritméticas 35.2 deve lançar erro para produtoArray de array vazio
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Array vazio não possui produto definido."

Received function did not throw

[Killed] ArithmeticOperator
src/operacoes.js:93:41
         // Lançar um erro para array vazio.
         throw new Error('Array vazio não possui produto definido.'); 
     }
-    return numeros.reduce((acc, val) => acc * val, 1);
+    return numeros.reduce((acc, val) => acc / val, 1);
 }
 function clamp(valor, min, max) {
killedBy: Suíte de Testes Reforçada para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 0.041666666666666664

[Killed] ArrowFunction
src/operacoes.js:93:27
         // Lançar um erro para array vazio.
         throw new Error('Array vazio não possui produto definido.'); 
     }
-    return numeros.reduce((acc, val) => acc * val, 1);
+    return numeros.reduce(() => undefined, 1);
 }
 function clamp(valor, min, max) {
killedBy: Suíte de Testes Reforçada para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] BlockStatement
src/operacoes.js:95:33
     }
     return numeros.reduce((acc, val) => acc * val, 1);
 }
-function clamp(valor, min, max) {
-  if (min > max) [min, max] = [max, min]; 
-  if (valor < min) return min;
-  if (valor > max) return max;
-  return valor;
-}
+function clamp(valor, min, max) {}
 function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
 function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
killedBy: Suíte de Testes Reforçada para 50 Operações Aritméticas 36. deve manter valor dentro do intervalo (clamp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:96:7
     return numeros.reduce((acc, val) => acc * val, 1);
 }
 function clamp(valor, min, max) {
-  if (min > max) [min, max] = [max, min]; 
+  if (min <= max) [min, max] = [max, min]; 
   if (valor < min) return min;
   if (valor > max) return max;
killedBy: Suíte de Testes Reforçada para 50 Operações Aritméticas 36. deve manter valor dentro do intervalo (clamp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 10

[Killed] ConditionalExpression
src/operacoes.js:96:7
     return numeros.reduce((acc, val) => acc * val, 1);
 }
 function clamp(valor, min, max) {
-  if (min > max) [min, max] = [max, min]; 
+  if (false) [min, max] = [max, min]; 
   if (valor < min) return min;
   if (valor > max) return max;
killedBy: Suíte de Testes Reforçada para 50 Operações Aritméticas 36.3 deve funcionar com limites invertidos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 10

[Killed] ConditionalExpression
src/operacoes.js:97:7
 }
 function clamp(valor, min, max) {
   if (min > max) [min, max] = [max, min]; 
-  if (valor < min) return min;
+  if (false) return min;
   if (valor > max) return max;
   return valor;
killedBy: Suíte de Testes Reforçada para 50 Operações Aritméticas 36. deve manter valor dentro do intervalo (clamp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/operacoes.js:97:7
 }
 function clamp(valor, min, max) {
   if (min > max) [min, max] = [max, min]; 
-  if (valor < min) return min;
+  if (true) return min;
   if (valor > max) return max;
   return valor;
killedBy: Suíte de Testes Reforçada para 50 Operações Aritméticas 36. deve manter valor dentro do intervalo (clamp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0
